Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: མ་ཕམ་པ་ འདི་ལྟ་སྟེ །_ དཔེར་ན་ མར་ མེད་པ ས་ མར་ གྱི་ སྙིང་ གུ འི་ རྒྱུན་ འཆད་ པ ར་ འགྱུར་བ་ དེ་བཞིན་ དུ །_
en: Ajita, consider this analogy. |#| If there were no butter there would no longer be any clarified butter. |#| Likewise,

source: མ་ཕམ་པ་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་པ་ མེད་པར་ དེ་བཞིན་ གཤེགས་པ་ མངོན་པར་ འགྲུབ་པ ར་ མི་ འགྱུར་ རོ །_།
en: Ajita, if the mind is not set on awakening one will never become a thus-gone one.

source: མ་ཕམ་པ་ འདི་ལྟ་སྟེ །_ དཔེར་ན་ མར་ ཡོད་པ ས་ མར་ གྱི་ སྙིང་ གུ འི་ རྒྱུན་ མི་འཆད་པ ར་ འགྱུར་བ་ དེ་བཞིན་ དུ །_
en: Ajita, consider this analogy. |#| When there is butter there is also an uninterrupted supply of clarified butter. |#| Similarly,

source: མ་ཕམ་པ་ འཇིག་རྟེན་ [51a] ན་ བྱང་ཆུབ་ སེམས་དཔའ་ ཡོད་པ ས་ འཇིག་རྟེན་ དུ་ དེ་བཞིན་ གཤེགས་པ་ འབྱུང་བ ར་ འགྱུར་ རོ །_།
en: Ajita, [51.a] when there are bodhisattvas in the world there will also be thus-gone ones.

source: མ་ཕམ་པ་ འདི་ལྟ་སྟེ །_ དཔེར་ན་ ས་བོན་ ཡོད་པ ས་ མྱུ་གུ་ འབྱུང་བ ར་ འགྱུར་བ་ དེ་བཞིན་ དུ །_ མ་ཕམ་པ་ བྱང་ཆུབ་ སེམས་དཔའ་ ཡོད་པ ས་ དེ་བཞིན་ གཤེགས་ པ་ འབྱུང་བ ར་ འགྱུར་ རོ །_།
en: Ajita, consider this analogy. |#| When there is a seed there can also be a sprout. |#| Likewise, Ajita, if there are bodhisattvas in the world there will also be thus-gone ones.

source: མ་ཕམ་པ་ དེ་ལྟ་བས་ན་ བྱང་ཆུབ་ སེམས་དཔའ་ རྙེད་པ ར་ དཀའ་བ་ ཉིད་ ཀྱི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ རྙེད་པ ར་ དཀའ་བ་ ཉིད་ དོ །_།
en: Ajita, the reason thus-gone ones are so rare is therefore precisely because bodhisattvas are rare.

source: མ་ཕམ་པ་ འདི་ལྟ་སྟེ །_ དཔེར་ན་ རྒྱ་མཚོ་ ཆེན་པོ་ ན་ གང་དག་ རིན་ཐང་ མེད་པར་ གྱུར་པ འི་ ནོར་བུ་ རིན་པོ་ཆེ་ དེ་དག་ ནི་ ཉུང་ གི་ གང་ དག་ རིན་ཐང་ ཡོད་པར་ གྱུར་པ་ དེ་དག་ ནི་ ཆེས་ མང་བ་ དེ་བཞིན་ དུ །_
en: $274 “Ajita, consider this analogy. |#| Compared to the priceless jewels in the ocean, there is a greater number of valuable jewels in general. |#| Similarly,

source: མ་ཕམ་པ་ སེམས་ཅན་ གྱི་ རིས་ ན་ གང་དག་ བྱང་ཆུབ་ ཀྱི་ སེམས་ དང་ ལྷན་ཅིག་ གནས་པ འི་ སེམས་ཅན་ དེ་དག་ ནི་ ཉུང་ངུ་ འབྱུང་ གི _།
en: among sentient beings there are only a few who abide by the mind of awakening.

source: གང་དག་ དེ་ལས་ གཞན་པ འི་ ཉན་ཐོས་ དང་ །_ རང་ སངས་རྒྱས་ ཀྱི་ སེམས་ དང་ ལྷན་ཅིག་ གནས་པ འི་ སེམས་ཅན་ དེ་དག་ ནི་ ཆེས་ མང་ དུ་ འབྱུང་བ ར་ འགྱུར་ རོ །_།
en: In comparison, those who keep the mindset of a hearer or a solitary buddha are so many.

source: མ་ཕམ་པ་ དེ་ལྟ་བས་ན་ སེམས་བསྐྱེད་པ་ དེ་དག་ ནི་ རྙེད་པ ར་ དཀའ་ ཞིང་མཆོག་ ཏུ་ རྙེད་པ ར་ དཀ འོ །_།
en: $275 “Thus, Ajita, those who give rise to the mind of awakening are rare. |#| They are extremely rare.

source: སེམས་བསྐྱེད་པ་ དེ་དག་ ནི་ རྙེད་པ ར་ དཀའ་ ཞིང་མཆོག་ ཏུ་ རྙེད་པ ར་ དཀའ་བ འི་ ཕྱིར་ ཨུ་ དུམ་ བཱ་ རི འི་ མེ་ཏོག་ དང་ མཚུངས་ སོ །_།
en: Being so extremely rare, they are like the uḍumbara flower.

source: སེམས་བསྐྱེད་པ་ དེ་དག་ ནི་ རིན་ཐང་ མེད་པ འི་ ཕྱིར་ རིན་པོ་ཆེ་ དང་ མཚུངས་ སོ །_།
en: Those who engender the mind of awakening are priceless, like priceless jewels.

source: སེམས་བསྐྱེད་པ་ དེ་དག་ ནི་ ཤིན་ཏུ་ འཕགས་པ འི་ ཕྱིར་ རི་རབ་ དང་ མཚུངས་ སོ །_།
en: Those who engender the mind of awakening are greatly superior, like Mount Meru.

source: སེམས་བསྐྱེད་པ་ དེ་དག་ ནི་ རབ་ཏུ་གཡོ་བ་ མེད་པ འི་ ཕྱིར་ ནམ་མཁའ་ དང་ མཚུངས་ སོ །_།
en: Those who engender the mind of awakening are utterly unmoving, like space.

source: སེམས་བསྐྱེད་པ་ དེ་དག་ ནི་ གཏིང་དཔག་ དཀའ་བ འི་ ཕྱིར་ རྒྱ་མཚོ་ ལྟ་བུ འོ །_།
en: Those who engender the mind of awakening are deep, like the ocean.

source: མ་ཕམ་པ་ སེམས་བསྐྱེད་པ་ དེས་ ནི་ རིན་པོ་ཆེ ས་ བཀང་བ འི་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ བཟོད་ དོ །_།
en: $276 “Ajita, those who engender the mind of awakening surpass a trichiliocosm filled with precious jewels.

source: མ་ཕམ་པ་ གལ་ཏེ་ སེམས་བསྐྱེད་པ་ དེ་དག་ ནི་ གཟུགས་ཅན་ དུ་ གྱུར་ ན་ ནི་ དེ་དག་ ཕྱག་ བྱ་བ འི་ འོས་ ཡིན་ ཏེ །_
en: Ajita, when those who engender the mind of awakening have a physical form they are worthy of homage, and,

source: མ་ཕམ་པ་ ལྷ་ དང་ བཅས་པ འི་ འཇིག་རྟེན་ འབུམ་ཕྲག་ དུ་མ ས་ བསྲུངས་པ ར་ འགྱུར་ རོ །_།
en: Ajita, they will be protected by hundreds of thousands of mundane beings—gods and others.

source: མ་ཕམ་པ་ དེ་ལྟ་བས་ན་ བྱང་ཆུབ་ ཀྱི་ སེམས་ དེ་ བསྐྱེད་པ འི་ ཕྱིར་ རྣལ་འབྱོར་ དུ་ བྱ །_ |#| སྤྲོ་བ ར་ བྱ །_ |#| མཐུ་ ཡོད་པར་ བྱ །_ |#| གསལ་བ ར་ བྱ །_ |#| [51b] སྤོབས་པ ར་ བྱ །_ |#| འཐུན་ པར་ བྱ །_ |#| འདུན་པ ར་ བྱ འོ །_།
en: Therefore, Ajita, persist in the practice of engendering the awakened mind. |#| Do so joyfully, forcefully, clearly, [51.b] boldly, and with commitment.

source: མ་ཕམ་པ་ སེམས་བསྐྱེད་པ་ དེ་ཡང་ གང་ཞེ་ན །_
en: $277 “Ajita, you may then wonder what it means to engender the mind of awakening.

source: བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་པ་ སྟེ །_ |#| དེ་ ནི་ བགྲང་བ འམ །_ གཞལ་བ ར་ མི་ ནུས་ སོ །_།
en: Arousing the mind of awakening is not something that can be counted or measured.

source: མ་ཕམ་པ་ འོན་ཀྱང་ སེམས་བསྐྱེད་པ་ དེ་ ཁོང་ དུ་ ཆུད་པ ར་ བྱ་བ འི་ ཕྱིར་ ཉེ་བ ར་ འཇལ་ བ་ ཙམ་ དང་ །_ དཔེ་ཙམ་ ཞིག་ བརྗོད་པ ར་ བྱ འོ །_།
en: Nevertheless, Ajita, for the sake of comprehension I shall give you just an illustration, just a single example.

source: མ་ཕམ་པ་ སྔོན་བྱུང་བ་ འདས་པ འི་ དུས་ ན་ བསྐལ་པ་ ཚད་ མེད་ གྲངས་མེད་པ །_ རྒྱ་ཆེན་པོ་ བྱུང་བ་ དེ འི་ ཚེ་ དེ འི་ དུས་ ན་ འདི་ལྟར་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ རིག་པ་ དང་ ཞབས་ སུ་ ལྡན་པ་ བདེ་བ ར་ གཤེགས་པ །_ འཇིག་རྟེན་ མཁྱེན་པ །_ སྐྱེས་བུ་ འདུལ་བ འི་ ཁ་ལོ་ སྒྱུར་བ །_ བླ་ ན་ |#| མེད་པ །_ ལྷ་ དང་ མི་ རྣམས་ ཀྱི་ སྟོན་པ །_ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ བདེ་བ འི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ འཇིག་རྟེན་ དུ་ བྱུང་བ ར་ གྱུར་ ཏོ །_།
en: Long ago in the past, before limitless and innumerable eons, there was a thus-gone one, a worthy one, a perfect buddha, someone wise and virtuous, a blissful one, a knower of the world, a steersman taming beings, an unsurpassable one, a teacher of gods and humans, a blessed buddha by the name of King of Bliss.

source: མ་ཕམ་པ་ བཅོམ་ལྡན་འདས་ དེ འི་ ཚེ འི་ ཚད་ ནི་ ལོ་ བརྒྱད་ ཁྲི་ བཞི་ སྟོང་ དུ་ གྱུར་ ཏོ །_།
en: Ajita, the lifespan of that blessed one was eighty-four thousand years.

source: མ་ཕམ་པ་ བཅོམ་ལྡན་འདས་ དེ འི་ ཉན་ཐོས་ འདུས་པ་ གཅིག་ ནི་ དགྲ་བཅོམ་པ་ བྱེ་ བ་ ཕྲག་ བདུན་ཅུ་ རྩ་ དྲུག་ བྱུང་བ ར་ གྱུར །_
en: Ajita, the first assembly of that blessed one’s hearers numbered seven hundred sixty million.

source: འདུས་པ་ གཉིས་པ་ ནི་ བྱེ་བ་ ཕྲག་ དགུ་ བཅུ་ རྩ་ དྲུག་ བྱུང་བ ར་ གྱུར །_ |#| འདུས་པ་ གསུམ་པ་ ནི་ བྱེ་བ་ ཕྲག་ བརྒྱ ར་ ཚང་བ་ བྱུང་བ ར་ གྱུར་ ཏེ །_
en: The second assembly contained nine hundred sixty million, and the third one billion hearers.

source: ཐམས་ཅད་ ཀྱང་ དགྲ་བཅོམ་པ །_ ཟག་པ་ ཟད་པ །_ བྱ་བ་ བྱས་པ །_ བྱེད་པ་ བྱས་པ །_ ཁུར་ བོར་བ །_ བདག་ གི་ དོན་ རྗེས་སུ་ ཐོབ་པ །_ སྲིད་པ ར་ ཀུན་ ཏུ་ སྦྱོར་བ་ ཡོངས་སུ་ ཟད་པ །_ མཉམ་པ་ཉིད་ ཀྱི་ ཤེས་པ ས་ རྣམ་པར་ གྲོལ་བ་ ཤ་སྟག་ གོ །_།
en: Without exception, they were all foe-destroyers who had brought an end to defilement, completed their task, completed their work, laid down the load, achieved their own objectives, exhausted the bonds to existence, and achieved liberation through the mind of equality.

source: མ་ཕམ་པ་ དེ འི་ དུས་ ན་ རྒྱལ་པོ འི་ ཕོ་བྲང་ ཤིན་ཏུ་ མཐོང་ ཞེས་ བྱ་བ ར་ རྒྱལ་པོ་ རྒྱལ་རིགས་ སྤྱི་བོ་ ནས་ དབང་ བསྐུར་བ་ སེང་གེ འི་ དཔལ་ ཞེས་ བྱ་བ་ བྱུང་བ ར་ གྱུར་ ཏོ །_།
en: At that time there was a royal palace known as Immense Vista, and within that palace resided a king of royal descent who had received anointment. |#| He was known by the name of Lion Glory, and

source: རྒྱལ་པོ་ སེང་གེ འི་ དཔལ་ དེ འི་ བཙུན་མོ་ དམ་པ་ མཆོག་ ལས་ བུ་ གཉིས་ མཚེ་མ ར་ བྱུང་བ ར་ གྱུར་ ཏེ །_ |#| གཅིག་ ནི་ མྱ་ངན་མེད་ ཅེས་ བྱ །_ |#| ཅིག་ཤོས་ ནི་ མྱ་ངན་ བྲལ་ ཞེས་ བྱ འོ །_།
en: his eminent queen gave birth to two twin boys, one named Aśoka and the other Vigataśoka.

source: མ་ཕམ་པ་ དེ འི་ དུས་ ན་ ཁྱེའུ་ དེ་ གཉིས་ སྐྱེས་ ནས་ ལོ་ བདུན་ ལོན་པ་ འདྲ་ ཞིང་ གཉི་ག་ ཁང་ བཟངས་ ན་ འདུག་པ ར་ གྱུར་ ཏེ །_ |#| དེ་ གཉིས་ ཀྱིས་ དེ་བཞིན་ གཤེགས་པ་ བདེ་བ འི་ རྒྱལ་པོ་ ཉན་ཐོས་ ཀྱི་ ཚོགས་ དང་ ཐབས་ཅིག་ ཏུ་ རྒྱལ་པོ འི་ ཕོ་བྲང་ ཤིན་ཏུ་ མཐོང་ [52a] བར་ གཤེགས་པ་ མཐོང་ ངོ་ །_།
en: $278 “Ajita, one day in the palace, when the two boys had grown to be seven years old, they saw the thus-gone King of Bliss enter the royal palace together with a gathering of hearers. [52.a]

source: དེ་ནས་ ཁྱེའུ་ མྱ་ངན་མེད་ ཀྱིས་ ཕུ་བོ་ མྱ་ངན་ བྲལ་ ལ་ སྨྲས་པ །_
en: The boy Aśoka then asked his brother, ‘

source: མྱ་ངན་ བྲལ་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ བདེ་བ འི་ རྒྱལ་པོ་ ཐག་ རིང་པོ་ ཁོ་ན་ ནས་ ཚུ ར་ གཤེགས་པ་ གཟིགས་ སམ །_
en: Vigataśoka , do you see the thus-gone one, the blessed one, the perfect buddha King of Bliss, as he approaches from afar?’

source: སྨྲས་པ །_
en: replied Vigataśoka.

source: ནུ་བོ་ མཐོང་ ངོ་ །_།
en: “ ‘Yes, brother, I see him,’

source: མྱ་ངན་ བྲལ་ བདག་ གིས་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ བདེ་བ འི་ རྒྱལ་པོ་ དེ་ ཅི་འདྲ་བ་ དེ་ལྟ་ བུ་ ཁོ་ན ར་ འགྱུར་བ ར་ བགྱི འོ །_།
en: $279 “ ‘ Vigataśoka ,’ |#| ‘I want to become just like the thus-gone one, the blessed one, the perfect buddha King of Bliss.”

source: དེ་ནས་ ཁྱེའུ་ མྱ་ངན་མེད་ ཀྱིས་ ཕུ་བོ་ མྱ་ངན་ བྲལ་ དེ་ |#| ལ་ཚིགས་ སུ་ བཅད་ པ་ དག་ གིས་ སྨྲས་པ །_
en: Prince Aśoka then spoke the following verses to his brother:

source: མགོན་པོ་ ཆེན་པོ་ མི་ ཡི་ མཆོག _། དགེ་སློང་ དགེ་འདུན་ མདུན་ བདར་བ །_། བདེ་བ འི་ རྒྱལ་པོ་ ཚུ ར་ གཤེགས་ ལ །_། མྱ་ངན་ བྲལ་བ་ ཁྱོད་ གཟིགས་ ཤིག _།
en: $280 “ ‘Behold the protector, supreme among humans, As he heads the saṅgha of monks, Leading them here. |#| Vigataśoka , watch King of Bliss.

source: མི་ ཡི་ ཁྱུ་མཆོག་ དེ་ འདྲ་བ ར །_། བདག་ ནི་ འགྱུར་བ་ ཁོ་ན ར་ བགྱི །_།
en: $281 “ ‘The one thing I must do is to become Just such a perfect leader of men.

source: བདག་ ལ་ བྱང་ཆུབ་ སེམས་ སྐྱེས་ ཏེ །_། |#| འཇིགས་ ལས་ འགྲོ་བ་ ཐར་བ ར་ བགྱི །_།
en: I shall engender the mind of awakening And liberate beings from fear.

source: འགྲོ་ འདི་ ཆགས་ རྒྱགས་ ཞེ་སྡང་ དང་ །_། ཆགས་པ ས་ སྡུག་བསྔལ་ ལས་ བགྱིད་ དེ །_།
en: $282 “ ‘Through craving, conceit, anger, and desire The world engages in painful acts.

source: བགྱིས་ ནས་ དམྱལ་བ འི་ གཡང་ས ར་ ལྟུང་ །_།
en: Through such acts they fall into the abyss of hell,

source: ངན་འགྲོ་ དག་ ལས་ དེ་ ཐར་ བགྱི །_།
en: Yet I shall free them from the lower realms.

source: འཇིག་རྟེན་ འདྲེན་པ་ འཇིག་རྟེན་ ན །_། |#| ཨུ་ དུམ་ བཱ་ ར འི་ མེ་ཏོག་ བཞིན །_། རྙེད་ དཀའ་ མཆོག་ ཏུ་ རྙེད་ དཀའ་ ཡིས །_། ཁྱོད་ ཀྱིས་ འདུན་པ་ བསྐྱེད་པ ར་ མཛོད །_།
en: $283 “ ‘I shall be the world’s guide. |#| Like the uḍumbara flowers of the world, This is the rarest of the rare.’ |#| This is the wish you should make.’

source: དེ་ནས་ ཁྱེའུ་ མྱ་ངན་ བྲལ་ གྱིས་ ནུ་བོ་ ལ་ཚིགས་ སུ་ བཅད་པ་ དག་ གིས་ སླར་ སྨྲས་པ །_
en: $284 “In reply, his brother Vigataśoka spoke the following verses:

source: མང་པོ་ ཚིག་ ཏུ་ སྨྲ་བྱེད་ ཀྱང་ །_། ཚིག་ གིས་ གྲུབ་པ་ ཡོད་ མ་ ཡིན །_།
en: “ ‘Even if words are many They do not make things happen.

source: བདག་ ནི་ སྒྲུབ་ ལ་ གནས་པ ས་ ན །_། |#| ཅི་ཡང་ རབ་ཏུ་ སྨྲ་ མི་ བྱ །_།
en: I remain in practice And say nothing at all.

source: མང་པོ་ རབ་ཏུ་ སྨྲ་བྱེད་ ཀྱང་ །_། ལུས་ ཀྱིས་ བྱེད་པ་ ཡོད་ མ་ ཡིན །_།
en: $285 “ ‘If, despite so much talking, The body does nothing,

source: དེ་ ཡི་ འབྲས་བུ་ མི་སྣང་བ ས །_། བརྫུན་ གྱི་ ཚིག་ ཏུ་ སྨྲ་བ་ ཉིད །_།
en: It is all fruitless, And the words become lies.

source: !གལ་ཏེ་ ཚིག་ གིས་ ཐོབ་ འགྱུར་ ན །_། |#| བདག་ འོད་ རི ར་ ཆེན་ དཀྲིས་ པར་ འགྱུར །_།
en: $286 “ ‘If words would make things happen People would shine like a jewel.#22

source: ཡོན་ཏན་ ཉམས་པ་ དེ་ ཀུན་ ཀྱང་ །_། ཚིག་ གིས་ རྒྱལ་བ་ རྣམས་ སུ་ འགྱུར །_།
en: Although their good qualities decrease, They declare themselves to be supreme.’

source: དེ་ནས་ ཁྱེའུ་ མྱ་ངན་མེད་ ཀྱིས་ ཁྱེའུ་ མྱ་ངན་ བྲལ་ ལ་ཚིགས་ སུ་ བཅད་པ་ དག་ གིས་ སླར་ སྨྲས་པ །_
en: $287 “Young Aśoka then spoke these verses to his brother Vigataśoka:

source: བདག་ཉིད་ ཡིན་ གྱི་ གཞན་ མིན་པ ར །_། གང་ ཕྱིར་ དེ་ འདྲ་ སྨྲ་བྱེད་ ཅིང་ །_།
en: “ ‘It is for the sake of oneself, and not others, That one would say such things.

source: དེ་ཕྱིར་ ཅི་ཡང་ མི་སྨྲ་བ །_། སེམས་ དེ་ སེར་སྣ་ ཅན་ གྱི་ ལགས །_།
en: Therefore, if one does not say anything at all One’s mind is suffering from stinginess. [52.b]

source: བདག་ གིས་ [52b] སེམས་ཅན་ འགྲོན་ དུ་ གཉེར །_།
en: $288 “ ‘I invite sentient beings to be my guests;

source: !བདག་ ནི་ ཀུན་ ཏུ་ བགེད་ པར་ བགྱིད །_།
en: I shall delight#23 them.

source: བདག་ ལ་ སེར་སྣ་ གཞར་ མ་ མཆིས །_།
en: For me there is no stinginess to get rid of.

source: སྲོག་ཆགས་ འདྲེན་པ་ རྣམས་ སུ་ ཤོག _།
en: May I be the guide of living beings.

source: མཁས་པ་ བྱུང་བ ར་ གྱུར་པ་ རྣམས །_། དེ་དག་ ཚིག་ ཏུ་ སྨྲ་ མི་ བྱེད །_།
en: $289 “ ‘The wise ones of the past Did not say such things.

source: ཚིག་ མང་ རབ་ཏུ་ སྨྲས་ ནས་ སུ །_། ཇི་ལྟ ར་ དོན་ བཞིན་ བྱེད་ མ་ ཡིན །_།
en: Some speak at great length But do not act accordingly.

source: དེ་དག་ སྔོན་ཆད་ ཉིད་ ནས་ ཀྱང་ །_། སེར་སྣ འི་ སེམས་ དང་ ལྡན་པ ར་ གྱུར །_།
en: $290 “ ‘Such people were also Stingy in the past.

source: དེས་ན་ འབྱུང་བ ར་ འགྱུར་ ཞིག་ གམ །_། འོན་ཏེ་ མི་ འབྱུང་ ཚིག་ ཏུ་ སྨྲ །_།
en: Hence they wonder Whether things are actually going to happen.’#24

source: དེ་ནས་ ཁྱེའུ་ མྱ་ངན་ བྲལ་ གྱིས་ ནུ་བོ་ མྱ་ངན་མེད་ ལ་ཚིགས་ སུ་ བཅད་པ ས་ སླར་ སྨྲས་པ །_
en: $291 “Young Vigataśoka then spoke again to his brother in verse:

source: གཅིག་ ཏུ་ གྱུར་ ནས་ སོང་ བྱས་ ཏེ །_། |#| ནུ་བོ་ ཁྱོད་ དང་ ཁོ་བོ་ ཡི །_། སེམས་བསྐྱེད་པ་ ནི་ གང་ ཆེ་ཞེ ས །_། མགོན་པོ་ དེ་ ལ་ ཞུ་བ ར་ བྱ །_།
en: “ ‘Brother, we should go together To ask the Protector Whether your way of developing The mind of awakening, or mine, is the greatest.’

source: དེ་ནས་ ཁྱེའུ་ མྱ་ངན་ བྲལ་ ཁང་ བཟངས་ ཀྱི་ སྟེང་ དེ་ནས་ བབས་ ཏེ །_
en: $292 “Young Vigataśoka then descended from the upper story of the palace and,

source: ནོར་བུ་ ལས་ བྱས་པ འི་ མཆིལ་ལྷམ་ ཐོགས་ ཤིང་ གོས་ བྱེ་བ་ རི་བ་ ཡང་ ཐོགས་ ནས །_
en: wearing sandals made of jewels and garments worth millions,

source: དེ་བཞིན་ གཤེགས་པ་ བདེ་བ འི་ རྒྱལ་པོ་ ག་ལ་བ་ དེར་ སོང་ སྟེ་ ཕྱིན་ ནས །_
en: he went to the place where the thus-gone King of Bliss was residing.

source: བཅོམ་ལྡན་འདས་ དེ འི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་ ཕྱོགས་ གཅིག་ ཏུ་ འདུག་ གོ །_།
en: There he bowed his head to the thus-gone one’s feet and took a place in the gathering.

source: ཁྱེའུ་ མྱ་ངན་མེད་ ཀྱིས་ ནི་ ཁང་ བཟངས་ གྱི་ སྟེང་ དེ་ཉིད་ ནས་ བདག་ཉིད་ བོར་ རོ །_། |#| དེ་ནས་ ཁྱེའུ་ མྱ་ངན་མེད་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ བདེ་བ འི་ རྒྱལ་ པོ་ དེ་ག་ ལ་བ་ དེར་ སོང་ ངོ་ །_།
en: Young Aśoka , on the other hand, jumped from the upper story, and in this way went before the thus-gone King of Bliss.

source: ཁྱེའུ་ དེས་ ཀྱང་ གོས་ རིན་པོ་ཆེ་ དང་ །_ གཙུག་ གི་ ནོར་བུ་ ཡང་ ཐོགས་པ ར་ གྱུར་ ཏེ །_
en: He also wore precious garments, and he carried a jewel as his crown ornament.

source: ཁྱེའུ་ དེས་ གོས་ དེ་ དང་ གཙུག་ གི་ ནོར་བུ་ དེ་ བཅོམ་ལྡན་འདས་ དེ་ ལ་ ཕུལ་བ་ དང་ །_ བཅོམ་ལྡན་འདས་ དེས་ ཁྱེའུ་ མྱ་ངན་མེད་ ཀྱི་ ལག་པ་ ནས་ བཞེས་ སོ །_།
en: But as he arrived, Aśoka offered his garments and jewel to the Blessed One, and the Blessed One accepted those gifts from the boy’s hand.

source: ཁྱེའུ་ མྱ་ངན་ བྲལ་ ནི་ ཕྱིས་ བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེར་ སོན་ གྱི་ ཁྱེའུ་ མྱ་ངན་མེད་ ནི་ ཆེས་ སྔར་ སོན་ ཏོ །_། |#| དེས་ ཁྱེའུ་ མྱ་ངན་མེད་ དེ་བཞིན་ གཤེགས་པ་ བདེ་བ འི་ རྒྱལ་པོ འི་ སྤྱན་སྔ་ ན་ འདུག་པ་ མཐོང་ ངོ་ །_།
en: $293 “In this way, young Vigataśoka in fact arrived in the Blessed One’s presence later than young Aśoka , who had gotten there much earlier.

source: མཐོང་ ནས་ ཀྱང་ སྨྲས་པ །_
en: When Vigataśoka noticed young Aśoka in the gathering around the thus-gone King of Bliss he asked him,

source: མྱ་ངན་མེད་ ཁྱོད་ ལམ་ གང་ ནས་ ཆེས་ སྔར་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ བདེ་བ འི་ རྒྱལ་པོ འི་ ཐད་ དུ་ སོང་ །_།
en: ‘ Aśoka , which way did you take to have arrived here before the thus-gone one, the blessed one, the perfect buddha King of Bliss so much earlier?’

source: དེས་ སྨྲས་པ །_
en: replied Aśoka ,

source: ཕུ་བོ་ ཁང་ བཟངས་ དེ་ཉིད་ ནས་ བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེར་ བདག་ཉིད་ བོར་ ཏེ །_
en: $294 “ ‘Brother,’ |#| ‘I jumped from our palace to this place where the Blessed One resides.

source: བདག་ ནི་ ལུས་ མ་ སྣད་ མ་ སྨས་པ་ ཁོ་ན ར་ བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེར་ མཆིས་ སོ །_།
en: Without any harm or injury to my body, I got here with great convenience.’ [53.a]

source: དེ་ནས་ ཁྱེའུ་ མྱ་ངན་ བྲལ་ [53a] གྱིས་ ཁྱེའུ་ མྱ་ངན་མེད་ ལས་ ལན་ ཐོས་ ནས །_ |#| བཅོམ་ལྡན་འདས་ དེ་ ལ་ མཆིལ་ལྷམ་ དེ་ གཉིས་ དང་ །_ གོས་ རིན་པོ་ཆེ་ དེ་ ཕུལ་ ནས་ དེ འི་ ཚེ་ ཚིགས་ སུ་ བཅད་ དེ་ གསོལ་པ །_
en: $295 “When he had heard young Aśoka ’s reply, young Vigataśoka offered his sandals and precious garments to the Blessed One and spoke the following verse:

source: ལམ་ངན་ ནས་ ནི་ འགྲོ་ མ་ འགྱུར །_། |#| འཇིག་རྟེན་ འདྲེན་པ་ མཐོང་ གྱུར་ཅིག _།
en: $296 “ ‘May we not take inferior paths, But behold the guide of the world.

source: སངས་ རྒྱས་ ཀྱིས་ ནི་ གང་ བསྟན་པ འི །_། ལམ་ ལ་ རྟག་ ཏུ་ བསྟེན་པ ར་ ཤོག _།
en: May we always follow The path taught by the buddhas.’

source: དེ་ནས་ ཁྱེའུ་ མྱ་ངན་མེད་ ཀྱིས་ ཀྱང་ ཕུ་བོ་ ལ་ཚིགས་ སུ་ བཅད་པ་ དག་ གིས་ སྨྲས་པ །_།
en: $297 “In verse, young Aśoka then addressed his brother:

source: གང་དག་ ལུས་ དང་ དེ་བཞིན་ དུ །_། སྲོག་ གི་ དབང་པོ་ སྲུང་བྱེད་པ །_། དེ་དག་ རྟག་ ཏུ་ ལམ་ ཚོལ་ འགྱུར །_།
en: “ ‘People who protect Their bodies and lives Are constantly looking for the path.

source: ཕུ་བོ་ དེ་ ནི་ ཁྱོད་ བཞིན་ ནོ །_།
en: Brother, you are just like such people.

source: གང་དག་ རྟག་ ཏུ་ བདེ་བ་ དོན་གཉེར་བ །_། དེ་དག་ གཞན་ གྱི་ བདེ་བ་ ཚོལ་ མི་ བྱེད །_།
en: $298 “ ‘Those always in pursuit of happiness Do not pursue the happiness of others.

source: ལུས་སྲོག་ དབང་པོ་ བོར་ ནས་ གཞན་ དུ་ ནི །_། སྡུག་བསྔལ་ རྣམ་པ་ སྣ་ཚོགས་ འབྱུང་བ ར་ འགྱུར །_།
en: When they leave their present body and life They come to suffer in numerous ways.

source: མི་ རྣམས་ ཀྱི་ ནི་ རྒྱ་ ཆེན་ དོན་ ཀྱང་ བྱ །_། |#| སྡུག་བསྔལ་ དྲ་བ་ ལས་ ནི་ ཡོངས་ སྒྲོལ་ བྱ །_།
en: $299 “ ‘We must be of great service to people And liberate them from the web of suffering.

source: ལམ་ འདི་ཉིད་ དེ་ སངས་རྒྱས་ མཐོང་བ་ འདི །_། སངས་རྒྱས་ མཐོང་ ནས་ ཕྱི་ ནས་ ལམ་ མ་ ཚོལ །_།
en: That very path leads to seeing buddhahood. |#| When buddhahood is seen one will no longer search for the path.

source: བདག་ཅག་ ལམ་ ནས་ བདེ་བ ར་ འགྲོ་ བྱ་ ཞེས །_། མ་ རྟོགས་ མི་ མཁས་ གཞན་དག་ རློམ་སེམས་ འགྱུར །_།
en: $300 “ ‘ “We shall take the path that leads to happiness.” |#| Thus think ignorant and unwise people,

source: དེ་ནས་ ལམ་ངན་ ལམ་ དེར་ འགྲོ་བ ར་ འགྱུར །_།
en: Yet they proceed on such inferior paths;

source: དེ་དག་ གིས་ ནི་ ཡང་དག་ ལམ་ མི་ ཤེས །_།
en: They do not know the true path.

source: ལམ་ངན་ འགྲོ་བ་ དོན་དམ་ བློ་ ཅན་ རྣམས །_། ལམ་ ལ་ དེ་ ནི་ ལམ་ངན་ ཞེས་ འཇུག་པ །_། དེ་ ནི་ རྟག་ ཏུ་ བདུད་ ཀྱི་ འཆིང་བ ས་ ཟིན །_། |#| དེ་ འདྲ་ དེ་ ནི་ ལམ་མཆོག་ འདི་ ལས་ རིང་ །_།
en: $301 “ ‘Those traveling inferior paths while thinking of the ultimate Proceed along paths of misfortune. |#| Tied up by the demons as they are, Such people are far from this supreme path.

source: རྟག་ ཏུ་ སངས་རྒྱས་ དག་ དང་ ཕྲད་ གྱུར་ཅིག _།_
en: $302 “ ‘May we always meet with buddhas;

source: རྟག་པ ར་ རྒྱུན་ ཏུ་ ངུར་སྨྲིག་ གྱོན་པ ར་ ཤོག _།_
en: May we always wear the ochre colors;

source: རྟག་ ཏུ་ ཚངས་པ ར་ སྤྱོད་པ་ ཐོབ་ གྱུར་ཅིག _།
en: May we always observe pure conduct;

source: སྐྱེས་ ནས་ ཤིན་ཏུ་ སེམས་ཅན་ དོན་ བྱེད་ ཤོག _།
en: May our lives be extremely beneficial to others;

source: དམ་ཆོས་ སྤྱོད་ ལ་ རྟག་ ཏུ་ གནས་ གྱུར་ཅིག _།
en: $303 “ ‘May we always abide by the practice of the sacred Dharma;

source: རྟག་ ཏུ་ ཆོས་ ཀྱང་ ཀུན་ ཏུ་ འཛིན་པ ར་ ཤོག _།
en: May we always uphold the Dharma;

source: རྟག་ ཏུ་ རྒྱལ་བ་ རྣམས་ ཀྱི་ ཆོས་ བཟུང་ ནས །_།
en: May we retain the Dharma of all the victorious ones forever;

source: རྟག་ ཏུ་ སྲོག་ཆགས་ རྣམས་ ལ་ ཕན་ བྱེད་ ཤོག _།_
en: May we always do good to living beings;

source: རྟག་ ཏུ་ བརྩོན་འགྲུས་ བརྟན་པོ ར་ རྩོམ་ གྱུར་ཅིག _།
en: $304 “ ‘May we constantly foster steadfast diligence;

source: ཐོས་པ འི་ ཆོས་ རྣམས་ ཆུད་ ཟ་མ་ གྱུར་ཅིག _།
en: May we never let the words we hear be wasted;

source: དུས་ རྣམས་ ཀུན་ ཏུ་ མཉམ་པ ར་ འཇོག་ གྱུར་ཅིག _།
en: May our equipoise be constant;

source: ཡོན་ཏན་ རྣམས་ ཀྱིས་ རྟག་ ཏུ་ བརྒྱན་པ ར་ ཤོག _།
en: And may we forever be adorned with all excellent qualities.’

source: མ་ཕམ་པ་ དེ་ནས་ ཁྱེའུ་ མྱ་ངན་མེད་ དང་ །_ ཁྱེའུ་ མྱ་ངན་ བྲལ་ གྱིས་ ཚིགས་ སུ་ བཅད་ [53b] པ་ དེ་དག་ སྨྲས་ ནས །_
en: $305 “Ajita, when young Aśoka and young Vigataśoka had spoken these verses [53.b]

source: དེ་བཞིན་ གཤེགས་པ་ བདེ་བ འི་ རྒྱལ་པོ འི་ ཐད་ དུ་ ཁྱིམ་ ནས་ ཁྱིམ་ མེད་པར་ འཐུན་ པར་ རབ་ཏུ་ བྱུང་ ངོ་ །_།
en: they both went forth from their homes to become monks under the thus-gone King of Bliss.

source: དེ་ལྟ ར་ དེ་དག་ རབ་ཏུ་ བྱུང་ མ་ ཐག་ ཏུ་ གཅིག་ ལ་ གཅིག་ སྨྲས་པ །_ བདག་ ཆེས་ ཐོག་མ ར་ དེ་བཞིན་ གཤེགས་པ ར་ འགྱུར་བ ར་ བྱ འོ །_།
en: As soon as they had gone forth, each one of them claimed that he would become a thus-gone one much earlier than the other.

source: དེ་ནས་ དགེ་སློང་ མྱ་ངན་མེད་ ཀྱིས་ དགེ་སློང་ མྱ་ངན་ བྲལ་ ལ་ སྨྲས་པ །_
en: The monk Aśoka then asked the monk Vigataśoka ,

source: མྱ་ངན་ བྲལ་ ཁྱོད་ ཀྱིས་ བདག་ ཆེས་ ཐོག་མ ར་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་པ ར་ འཚང་རྒྱ་བ ར་ བྱ འོ་ ཞེས་ དེ་སྐད་ ཅེས་ སྨྲས་ ན |#| ཁྱོད་ ཀྱིས་ སེམས་ ཇི་ལྟ་བུ་ ཞིག་ བསྐྱེད །_
en: ‘What sort of mindset have you aroused, since you claim that you will be the first to awaken to unexcelled and perfect buddhahood?’

source: མྱ་ ངན་མེད་ འདིར་ བདག་ གིས་ ནི་ གལ་ཏེ་ བདག་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་པ ར་ སངས་ མ་ རྒྱས་ ཀྱི་ བར་ དུ་ སེམས་ཅན་ རེ་རེ འི་ དོན་ གྱི་ ཕྱིར་ སེམས་ཅན་ དམྱལ་བ་ རྣམས་ སུ་ བསྐལ་པ་ འབུམ་ དུ་ སྨིན་པ ར་ གྱུར་ ན |#| འང་ དེ འི་ ཚེ་ ཡང་ བྱང་ཆུབ་ ཀྱི་ སེམས་ དོར་བ ར་ མི་ བྱ འོ་ སྙམ་ སྟེ
en: $306 “ ‘ Aśoka ,’ |#| ‘I think in this way: until I have awakened to unexcelled and perfect buddhahood, I shall never give up the mind of awakening, even if I must bring every single being to maturation by remaining in hell for a hundred thousand eons.

source: མྱ་ངན་མེད་ བདག་ གིས་ སེམས་ དེ་ལྟ་ བུ་ བསྐྱེད་ དོ །_།
en: Such is the quality of the mind that I bring forth.

source: མྱ་ངན་མེད་ འོན་ཀྱང་ བདག་ གིས་ གལ་ཏེ་ བདག་ གི་ མགོ་བོ ར་ ཤར་ཕྱོགས་ དང་ །_ དེ་བཞིན་ དུ་ ཕྱོགས་ ཐམས་ཅད་ ནས་ ལ་ལ་ ཞིག་ འོངས་ ཏེ །_ |#| བཤང་བ འི་ ཆང་ བུ འམ །_ མེ འི་ རིལ་ ལུའམ །_ རྡུལ་ གྱི་ རིལ་ ལུའམ །_ བཤང་ བ འི་ བུམ་པ འམ །_ མེ འི་ བུམ་པ འམ །_ རྡུལ་ གྱི་ བུམ་པ་ ཞིག་ བཞག་ ཀྱང་
en: Aśoka , even if people come from the east, and from all the other directions, and place upon my head piles of feces, fire, or dirt, or a pot of excrement, fire, or dirt,

source: གཞི་ དེ་ལས་ བདག་ གིས་ གནོད་སེམས་ སུ་ མི་ བྱ །_ |#| ཞེ་སྡང་ བསྐྱེད་པ ར་ མི་ བྱ །_
en: I shall not allow that to make me angry and lose my temper.

source: སེམས་ ཁྲོས་པ ས་ མི་ དེ་ ལ་ རྣམ་པར་ བལྟ་བ ར་ མི་ བྱ །_
en: I shall not scowl angrily at such people,

source: སེམས་ ཁྲོས་པ་ དང་ ལྡན་པ ས་ དེ་ ལ་ ངས་ གནོད་པ་ ཅི་ བྱས་ ཞེས་ དེ་སྐད་ ཅེས་ ཀྱང་ སྨྲ་བ ར་ མི་ བྱ་ སྟེ །_
en: nor shall I speak spitefully of revenge.

source: ཕྱིར་རྒོལ་བ་ སུ་ གང་ གིས་ ལས་ དེ་ བརྩམས་པ འི་ སེམས་ཅན་ དེ་ཉིད་ ཀྱི་ དོན་ གྱི་ ཕྱིར་ བདག་ གིས་ ཕ་རོལ་ དུ་ ཕྱིན་པ་ དག་ ལ་ སྤྱད་པ ར་ བྱ་ སྟེ །_
en: Instead, I shall practice the perfections for the sake of those very people who attack me.

source: དེས་ གང་ བྱས་པ འི་ ལས་ དེ་ ནི་ སངས་རྒྱས་ ཀྱི་ ཡེ་ཤེས་ རྩོམ་པ་ ཡིན །_
en: Therefore, all their acts serve only to generate the wisdom of the buddhas.

source: ལས་ དེ་ ནི་ སངས་རྒྱས་ ཀྱི་ ཆོས་ རྩོམ་པ་ ཡིན་ ཏེ །_
en: All their acts serve only to engender the qualities of the buddhas.

source: གལ་ཏེ་ བདག་ གིས་ རྐྱེན་ དག་ བྱུང་བ་ ན་ སེམས་ མཉམ་པ ར་ མ་ བཞག་ ན །_
en: If I, in the face of such abuse, were to abandon my equipoise, then

source: བདག་ གིས་ བཟོད་པ འི་ ཕ་རོལ་ དུ་ ཕྱིན་པ་ ཇི་ལྟ ར་ ཡོངས་སུ་ རྫོགས་པ ར་ བྱེད་པ ར་ འགྱུར །_
en: how would I be able to accomplish the perfection of patience?

source: བདག་ ལ་ གནོད་སེམས་ ཀྱི་ རྐྱེན་ དག་མ་ བྱུང་བ ར་ ནི་ ཡ་མཚན་ ཅིར་ འགྱུར་ ཏེ །_
en: What should be extraordinary about this, if such circumstances for ill will would not come up?
